app/views/relations/index.html.erb

                    <div class="col-lg-10">
                      <%= select(:table,"id", Table.all.collect {|p| [ p.name, p.id ] }, {include_blank: 'None'}, {class: "form-control"}) %>
---
SELECT "tables".* FROM "tables"