app/views/tables/show.html.erb

  <tbody>
    <% @table.relations.each do |relation| %>
---
SELECT "relations".* FROM "relations"  WHERE "relations"."table_id" = ?  [["table_id", 1]]