app/controllers/relations_controller.rb

SELECT  "relations".* FROM "relations"  LIMIT 25 OFFSET 0
---
  def index
    @relations = Relation.page(params[:page])

INSERT INTO "relations" ("created_at", "id_aero", "id_aptour", "model", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-12-02 18:12:53.673880"], ["id_aero", 1], ["id_aptour", 2], ["model", "Hotel"], ["updated_at", "2014-12-02 18:12:53.673880"]]
---
  def create
    @relation = Relation.new(relation_params)

    respond_to do |format|
      if @relation.save

DELETE FROM "relations" WHERE "relations"."id" = ?  [["id", 1]]
---
  def destroy
    @relation.destroy

SELECT  "relations".* FROM "relations"  WHERE "relations"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_relation
      @relation = Relation.find(params[:id])