app/controllers/tables_controller.rb

  def create
    @table = Table.new(table_params)

    respond_to do |format|
      if @table.save
---
INSERT INTO "tables" ("created_at", "name", "name_aero", "name_aptour", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-12-02 20:13:50.313864"], ["name", "Destinos"], ["name_aero", "Destinations"], ["name_aptour", "t_destinations"], ["updated_at", "2014-12-02 20:13:50.313864"]]

    def set_table
      @table = Table.find(params[:id])
---
SELECT  "tables".* FROM "tables"  WHERE "tables"."id" = ? LIMIT 1  [["id", 1]]