app/controllers/tables_controller.rb

  def index
    @tables = Table.order("name").page(params[:page]).per(10)
---
SELECT COUNT(*) FROM "tables"